app/views/articles/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."article_id" = ?  [["article_id", 2]]
---
<h2>Posts</h2>
<% @article.posts.each do |post| %>